[ViperTemplarSoldier X2CharacterTemplate]
strCharacterName="Viper Templar"

[ViperSoldier X2CharacterTemplate]
strCharacterName="Viper Soldier"

[ViperSoldier_VIP X2CharacterTemplate]
strCharacterName="Viper Soldier"

[ViperCivilian_VIP X2CharacterTemplate]
strCharacterName="Viper Civilian"

[ViperSoldier_VIP X2CharacterTemplate]
strCharacterName="Viper Civilian"

[Viper_HostileCivilianVIP X2CharacterTemplate]
strCharacterName="Viper Civilian"

[ViperRecruit X2SoldierClassTemplate]
DisplayName="Viper Recruit"

[XComGame.UIArmory_Loadout]
[UIArmory_Loadout]

m_strInventoryLabels[eInvSlot_ViperMAW]=M.A.W Implant

[Country_Vipern X2CountryTemplate]
DisplayName="Vipern"
DisplayNameWithArticle="Vipern"
DisplayNameWithArticleLower="Vipern"
DisplayNamePossessive="Vipern's"
DisplayAdjective="Vipernish"

[VW_GetOverHere X2AbilityTemplate]
LocFriendlyName="Tongue Pull"
LocLongDescription="The Viper launches it's tongue at a enemy target, attempting to yank them to their posision for a potential follow-up maneuver."
LocHelpText="Attempt to grab and pull a hostile target towards you with your tongue, allowing a follow-up attack or simpily displacing a enemy unit. Only humans or humanoid aliens can be pulled."
LocFlyOverText="Tongue Grab"
LocMissMessage="Grab Failed!"

[VW_FriendlyGetOverHere X2AbilityTemplate]
LocFriendlyName="Ally Tongue Pull"
LocLongDescription="The Viper launches it's tongue at an ally, attempting to pull them towards themselfs in an attempt to re-posision them on the field."
LocHelpText="Grab a ally target with your tongue and pull them to a tile next to you. Doing so grants the ally a free movement action to re-posision themselfs, allowing for better maneuverability on the battlefield. Only humans or humanoid aliens can be pulled."
LocFlyOverText="Ally Tongue Grab"
LocMissMessage="Pull Failed!"

[BoaGetOverHere_VW X2AbilityTemplate]
LocFriendlyName="Boa Tongue Pull"
LocLongDescription="The Viper launches it's tongue at a enemy target, attempting to yank them to their posision for a potential follow-up maneuver."
LocHelpText="Attempt to grab and pull a hostile target towards you with your tongue, allowing a follow-up attack or simpily displacing a enemy unit. Only humans or humanoid aliens can be pulled."
LocFlyOverText="Tongue Grab"
LocMissMessage="Grab Failed!"

[PrimeGetOverHere_VW X2AbilityTemplate]
LocFriendlyName="Prime Tongue Pull"
LocLongDescription="The Viper launches it's tongue at a enemy target, attempting to yank them to their posision for a potential follow-up maneuver."
LocHelpText="Attempt to grab and pull a hostile target towards you with your tongue, allowing a follow-up attack or simpily displacing a enemy unit. Only humans or humanoid aliens can be pulled."
LocFlyOverText="Tongue Grab"
LocMissMessage="Grab Failed!"

[EliteGetOverHere_VW X2AbilityTemplate]
LocFriendlyName="Elite Tongue Pull"
LocLongDescription="The Viper launches it's tongue at a enemy target, attempting to yank them to their posision for a potential follow-up maneuver."
LocHelpText="Attempt to grab and pull a hostile target towards you with your tongue, allowing a follow-up attack or simpily displacing a enemy unit. Only humans or humanoid aliens can be pulled."
LocFlyOverText="Tongue Grab"
LocMissMessage="Grab Failed!"

[VW_CivilianBind X2AbilityTemplate]
LocFriendlyName="Bind"
LocLongDescription="While it's still feasible, depending on the situation, this Viper's bind is significantly weaker, and can be broken out of easily in addition to only being able to hold the bind nothing more."
LocHelpText="Bind an adjacent humanoid enemy. Additional sustained bind options are unavalible to this unit."
LocFlyOverText="Bind"
LocMissMessage="Bind Failed!"

[VW_CivilianBindSustained X2AbilityTemplate]
LocFriendlyName="Hold"
LocLongDescription="While weaker than the average, the civilian Viper's bind can still hold onto a target, though it doesn't require much struggle to break free from."
LocHelpText="Hold a target in your coils."
LocFlyOverText="Hold"
LocMissMessage="Bind Broken!"

[VW_Bind X2AbilityTemplate]
LocFriendlyName="Bind"
LocLongDescription="The coils of a Viper are inhumanly strong, and can bind an adjacent humanoid enemy, holding them in place and allowing the Viper to decide their next attack, as long as they have the strength to maintain the bind."
LocHelpText="Bind an adjacent humanoid enemy, allowing for more bind options for you to peform."
LocFlyOverText="Bind"
LocMissMessage="Bind Failed!"

[VW_BindSustained X2AbilityTemplate]
LocFriendlyName="Hold"
LocLongDescription="The Viper holds the victim in it's coils firmly, Neither crushing them or letting them go, waiting for a follow-up."
LocHelpText="Hold a target in your coils, making them have a harder time escaping, but not attempting to deal any damage or effects to the captive."
LocFlyOverText="Hold"
LocMissMessage="Bind Broken!"

[VW_BindSustainedCrush X2AbilityTemplate]
LocFriendlyName="Crush"
LocLongDescription="The Viper attempts to crush the victim in it's coils, dealing damage depending on how strong the Viper is, although this carries some risk of the Viper losing it's grip on the target, and failing the bind."
LocHelpText="Attempt to crush a target in your coils to damage them depending on how strong you are against them. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Crush"
LocMissMessage="Crush Failed!"

[VW_BindSustainedSubdue X2AbilityTemplate]
LocFriendlyName="Subdue"
LocLongDescription="The Viper attempts to subdue the victim in it's coils, dealing no damage to the target, but inflicting them with mental debufs such as Disorientation, Stunning them or Knocking them unconscious, although this carries some risk of the Viper losing it's grip on the target, and failing the bind."
LocHelpText="Attempt to subdue a target in your coils to inflict certain mental debuffs depending on how strong you are against them. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Subdue"
LocMissMessage="Subdue Failed!"

[VW_BindSustainedChoke X2AbilityTemplate]
LocFriendlyName="Choke"
LocLongDescription="The Viper attempts to choke the victim in it's coils, dealing potentally less damage than crushing them, but suffocating them with a chance of knocking them unconscious, although this carries a higher risk of the Viper losing it's grip on the target, and failing the bind."
LocHelpText="Attempt to choke a target in your coils to damage them depending on how strong you are against them as well as potentally knocking them unconscious. Has a moderatly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Choke"
LocMissMessage="Choke Failed!"

[VW_EndBind X2AbilityTemplate]
LocFriendlyName="Release Bind"
LocLongDescription="In the event the tactical situation changes, the Viper can release the target in its coils, although this weakens it's coils, preventing it from binding again for a short while."
LocHelpText="Release the target in your coils. Triggers a cooldown on being able to bind again."
LocFlyOverText="Release"

[VW_EndBindAlt X2AbilityTemplate]
LocFriendlyName="Release Bind"
LocLongDescription="Upon disabling the victim in its coils, the Viper releases it's hold on the target, and can Bind another target without delay."
LocHelpText="Release the disabled target in your coils."
LocFlyOverText="Release"



[GetOverHere X2AbilityTemplate]
LocFriendlyName="Tongue Pull"
LocLongDescription="A Viper's tongue and neck are immensely strong, and can yank a humanoid target to it's posision."
LocHelpText="Grab a hostile target with your tongue and pull them to a tile next to you. Only humans or humanoid aliens can be pulled."
LocFlyOverText="Tongue Grab"
LocMissMessage="Grab Failed!"

[Bind X2AbilityTemplate]
LocFriendlyName="Bind"
LocLongDescription="The coils of a Viper are inhumanly strong, and can bind an adjacent humanoid enemy, holding them in place and allowing the Viper to decide their next attack, as long as they have the strength to maintain the bind."
LocHelpText="Bind and hold an adjacent humanoid enemy, allowing for more bind options for you to peform."
LocFlyOverText="Bind"
LocMissMessage="Bind Failed!"

[BoaRushAndBind X2AbilityTemplate]
LocFriendlyName="Rush and Bind"
LocLongDescription="The Boa can move up to an enemy target and bind them in a single action, holding them in place and allowing the Boa to decide their next attack, as long as they have the strength to maintain the bind"
LocHelpText="Bind and hold a humanoid enemy within movement range."
LocFlyOverText="Bind"
LocMissMessage="Bind Failed!"

[AdderRushAndBind X2AbilityTemplate]
LocFriendlyName="Rush and Bind"
LocLongDescription="The Adder can move up to an enemy target and bind them in a single action, holding them in place and allowing the Adder to decide their next attack, as long as they have the strength to maintain the bind"
LocHelpText="Bind and hold a humanoid enemy within movement range."
LocFlyOverText="Bind"
LocMissMessage="Bind Failed!"

[BindSustained X2AbilityTemplate]
LocFriendlyName="Hold"
LocLongDescription="The Viper holds the victim in it's coils firmly, Neither crushing them or letting them go, waiting for a follow-up."
LocHelpText="Hold a target in your coils, making them have a harder time escaping, but not attempting to deal any damage or effects to the captive."
LocFlyOverText="Hold"
LocMissMessage="Bind Broken!"

[BindSustainedCrush X2AbilityTemplate]
LocFriendlyName="Crush"
LocLongDescription="The Viper attempts to crush the victim in it's coils, dealing damage depending on how strong the Viper is, although this carries some risk of the Viper losing it's grip on the target, and failing the bind."
LocHelpText="Attempt to crush a target in your coils to damage them depending on how strong you are against them. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Crush"
LocMissMessage="Crush Failed!"

[BoaBindSustainedCrush X2AbilityTemplate]
LocFriendlyName="Boa Crush"
LocLongDescription="The Viper attempts to crush the victim in it's coils, dealing damage depending on how strong the Viper is, although this carries some risk of the Viper losing it's grip on the target, and failing the bind."
LocHelpText="Attempt to crush a target in your coils to damage them depending on how strong you are against them. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Crush"
LocMissMessage="Crush Failed!"

[PrimeBindSustainedChoke X2AbilityTemplate]
LocFriendlyName="Prime Choke"
LocLongDescription="The Viper attempts to choke the victim in it's coils, dealing potentally less damage than crushing them, but suffocating them with a chance of knocking them unconscious, although this carries a higher risk of the Viper losing it's grip on the target, and failing the bind."
LocHelpText="Attempt to choke a target in your coils to damage them depending on how strong you are against them as well as potentally knocking them unconscious. Has a moderatly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Choke"
LocMissMessage="Choke Failed!"

[EliteBindSustainedChoke X2AbilityTemplate]
LocFriendlyName="Elite Choke"
LocLongDescription="The Viper attempts to choke the victim in it's coils, dealing potentally less damage than crushing them, but suffocating them with a chance of knocking them unconscious, although this carries a higher risk of the Viper losing it's grip on the target, and failing the bind."
LocHelpText="Attempt to choke a target in your coils to damage them depending on how strong you are against them as well as potentally knocking them unconscious. Has a moderatly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Choke"
LocMissMessage="Choke Failed!"

[BindSustainedSubdue X2AbilityTemplate]
LocFriendlyName="Subdue"
LocLongDescription="The Viper attempts to subdue the victim in it's coils, dealing no damage to the target, but inflicting them with mental debufs such as Disorientation, Stunning them or Knocking them unconscious, although this carries some risk of the Viper losing it's grip on the target, and failing the bind."
LocHelpText="Attempt to subdue a target in your coils to inflict certain mental debuffs depending on how strong you are against them. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Subdue"
LocMissMessage="Subdue Failed!"

[BoaBindSustainedSubdue X2AbilityTemplate]
LocFriendlyName="Boa Subdue"
LocLongDescription="The Viper attempts to subdue the victim in it's coils, dealing no damage to the target, but inflicting them with mental debufs such as Disorientation, Stunning them or Knocking them unconscious, although this carries some risk of the Viper losing it's grip on the target, and failing the bind."
LocHelpText="Attempt to subdue a target in your coils to inflict certain mental debuffs depending on how strong you are against them. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Subdue"
LocMissMessage="Subdue Failed!"

[PrimeBindSustainedSubdue X2AbilityTemplate]
LocFriendlyName="Prime Subdue"
LocLongDescription="The Viper attempts to subdue the victim in it's coils, dealing no damage to the target, but inflicting them with mental debufs such as Disorientation, Stunning them or Knocking them unconscious, although this carries some risk of the Viper losing it's grip on the target, and failing the bind."
LocHelpText="Attempt to subdue a target in your coils to inflict certain mental debuffs depending on how strong you are against them. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Subdue"
LocMissMessage="Subdue Failed!"

[EliteBindSustainedSubdue X2AbilityTemplate]
LocFriendlyName="Elite Subdue"
LocLongDescription="The Viper attempts to subdue the victim in it's coils, dealing no damage to the target, but inflicting them with mental debufs such as Disorientation, Stunning them or Knocking them unconscious, although this carries some risk of the Viper losing it's grip on the target, and failing the bind."
LocHelpText="Attempt to subdue a target in your coils to inflict certain mental debuffs depending on how strong you are against them. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Subdue"
LocMissMessage="Subdue Failed!"

[EndBind X2AbilityTemplate]
LocFriendlyName="Release Bind"
LocLongDescription="In the event the tactical situation changes, the Viper can release the target in its coils, although this weakens their coils, preventing them from binding again for a short while."
LocHelpText="Release the target in your coils. Triggers a cooldown on being able to bind again."
LocFlyOverText="Release"

[EndBindAlt X2AbilityTemplate]
LocFriendlyName="Release Bind"
LocLongDescription="Upon disabling the victim in its coils, the Viper releases it's hold on the target, and can Bind another target without delay."
LocHelpText="Release the disabled target in your coils."
LocFlyOverText="Release"



[KingGetOverHere X2AbilityTemplate]
LocFriendlyName="Tongue Pull"
LocLongDescription="A Viper's tongue and neck are immensely strong, and can yank a humanoid target to it's posision."
LocHelpText="Grab a hostile target with your tongue and pull them to a tile next to you. Only humans or humanoid aliens can be pulled."
LocFlyOverText="Tongue Grab"
LocMissMessage="Grab Failed!"

[KingBind X2AbilityTemplate]
LocFriendlyName="Bind"
LocLongDescription="The coils of the Viper King are inhumanly strong, and can bind an adjacent humanoid enemy, holding them in place and allowing the Viper King to decide their next attack, as long as he has the strength to maintain the bind."
LocHelpText="Bind and hold an adjacent humanoid enemy, allowing for more bind options for you to peform."
LocFlyOverText="Bind"
LocMissMessage="Bind Failed!"

[KingBindSustained X2AbilityTemplate]
LocFriendlyName="Hold"
LocLongDescription="The Viper King holds the victim in his coils firmly, Neither crushing them or letting them go, waiting for a follow-up."
LocHelpText="Hold a target in your coils, making them have a harder time escaping, but not attempting to deal any damage or effects to the captive."
LocFlyOverText="Hold"
LocMissMessage="Bind Broken!"

[KingBindSustainedChoke X2AbilityTemplate]
LocFriendlyName="Choke"
LocLongDescription="The Viper King attempts to choke the victim in his coils, suffocating them with a chance of knocking them unconscious, although this carries some risk of the Viper King losing his grip on the target, and failing the bind."
LocHelpText="Attempt to choke a target in your coils to damage them depending on how strong you are against them as well as potentally knocking them unconscious. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Choke"
LocMissMessage="Choke Failed!"

[KingBindSustainedSubdue X2AbilityTemplate]
LocFriendlyName="Subdue"
LocLongDescription="The Viper King attempts to subdue the victim in his coils, dealing no damage to the target, but inflicting them with mental debufs such as Disorientation, Stunning them or Knocking them unconscious, although this carries some risk of the Viper King losing his grip on the target, and failing the bind."
LocHelpText="Attempt to subdue a target in your coils to inflict certain mental debuffs depending on how strong you are against them. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Subdue"
LocMissMessage="Subdue Failed!"

[KingEndBind X2AbilityTemplate]
LocFriendlyName="Release Bind"
LocLongDescription="In the event the tactical situation changes, the Viper King can release the target in his coils, although this weakens his coils, preventing him from binding again for a short while."
LocHelpText="Release the target in your coils. Triggers a cooldown on being able to bind again."
LocFlyOverText="Release"

[KingEndBindAlt X2AbilityTemplate]
LocFriendlyName="Release Bind"
LocLongDescription="Upon disabling the victim in his coils, the Viper King releases his hold on the target, and can Bind another target without delay."
LocHelpText="Release the disabled target in your coils."
LocFlyOverText="Release"


[NeonateBind X2AbilityTemplate]
LocFriendlyName="Bind"
LocLongDescription="While weaker than the average Viper, the Neonate can bind an adjacent target, and hold it in place temporarly to disable a target for a short time. Due to it's realitivly weaker coils, the bind can quickly be broken out of."
LocHelpText="Bind and hold an adjacent humanoid enemy temporarly."
LocFlyOverText="Bind"
LocMissMessage="Bind Failed!"

[MoveAndNeonateBind X2AbilityTemplate]
LocFriendlyName="Rush and Bind"
LocLongDescription="While weaker than the average Viper, the Neonate can move up to an enemy target and bind them in a single action, and hold it in place temporarly to disable a target for a short time. Due to it's realitivly weaker coils, the bind can quickly be broken out of."
LocHelpText="Bind and hold a humanoid enemy within movement range temporarly."
LocFlyOverText="Bind"
LocMissMessage="Bind Failed!"

[NeonateBindSustained X2AbilityTemplate]
LocFriendlyName="Hold"
LocLongDescription="The Neonate coils are far too weak to be able to crush a humanoid, therefore, they can only temporarly hold a target before it's weak strength causes it's bind to break."
LocHelpText="Hold a target in your coils."
LocFlyOverText="Hold"
LocMissMessage="Bind Broken!"

[NeonateEndBind X2AbilityTemplate]
LocFriendlyName="Release Bind"
LocLongDescription="In the event the tactical situation changes, the Neonate can release the target in its coils, although this weakens their coils, preventing them from binding again for a short while."
LocHelpText="Release the target in your coils. Triggers a cooldown on being able to bind again."
LocFlyOverText="Release"

; - Bite -

[BoaBite X2AbilityTemplate]
LocFriendlyName = "Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting raw damage upon the target."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost 1 AP to use."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost 1 AP to use."

[MAW_NeutralBite X2AbilityTemplate]
LocFriendlyName = "Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting raw damage upon the target."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/>"
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/>"

[MAW_PoisonBite_I X2AbilityTemplate]
LocFriendlyName = "Venomous Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and poisoning them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Venomous Bite will also poison the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Venomous Bite will also poison the target upon hit."

[MAW_PoisonBite_II X2AbilityTemplate]
LocFriendlyName = "Venomous Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and poisoning them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Venomous Bite will also poison the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Venomous Bite will also poison the target upon hit."

[MAW_PoisonBite_III X2AbilityTemplate]
LocFriendlyName = "Venomous Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and poisoning them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Venomous Bite will also poison the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Venomous Bite will also poison the target upon hit."


[MAW_IceBite_I X2AbilityTemplate]
LocFriendlyName = "Icy Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and freezing them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Icy Bite will also freeze the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Icy Bite will also freeze the target upon hit."

[MAW_IceBite_II X2AbilityTemplate]
LocFriendlyName = "Icy Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and freezing them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Icy Bite will also freeze the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Icy Bite will also freeze the target upon hit."

[MAW_IceBite_III X2AbilityTemplate]
LocFriendlyName = "Icy Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and freezing them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Icy Bite will also freeze the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Icy Bite will also freeze the target upon hit."


[MAW_HealBite_I X2AbilityTemplate]
LocFriendlyName = "Sedative Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting disorientation, stun and potentally knocking the the target unconscious."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Sedative Bite has a <Ability:HEAL_DISORIENTCHANCE_I/> chance to disorient for <Ability:HEAL_DISORIENTLENGTH_I/> turns, <Ability:HEAL_STUNCHANCE_I/> chance to stun for <Ability:HEAL_STUNLENGTH_I/> turns and a <Ability:HEAL_UNCONSCIOUSHANCE_I/> chance to render the target unconscious."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Sedative Bite has a <Ability:HEAL_DISORIENTCHANCE_I/> chance to disorient for <Ability:HEAL_DISORIENTLENGTH_I/> turns, <Ability:HEAL_STUNCHANCE_I/> chance to stun for <Ability:HEAL_STUNLENGTH_I/> turns and a <Ability:HEAL_UNCONSCIOUSHANCE_I/> chance to render the target unconscious."

[MAW_HealBite_II X2AbilityTemplate]
LocFriendlyName = "Sedative Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting disorientation, stun and potentally knocking the the target unconscious."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Sedative Bite has a <Ability:HEAL_DISORIENTCHANCE_II/> chance to disorient for <Ability:HEAL_DISORIENTLENGTH_II/> turns, <Ability:HEAL_STUNCHANCE_II/> chance to stun for <Ability:HEAL_STUNLENGTH_II/> turns and a <Ability:HEAL_UNCONSCIOUSHANCE_II/> chance to render the target unconscious."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Sedative Bite has a <Ability:HEAL_DISORIENTCHANCE_II/> chance to disorient for <Ability:HEAL_DISORIENTLENGTH_II/> turns, <Ability:HEAL_STUNCHANCE_II/> chance to stun for <Ability:HEAL_STUNLENGTH_II/> turns and a <Ability:HEAL_UNCONSCIOUSHANCE_II/> chance to render the target unconscious."

[MAW_HealBite_III X2AbilityTemplate]
LocFriendlyName = "Sedative Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting disorientation, stun and potentally knocking the the target unconscious."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Sedative Bite has a <Ability:HEAL_DISORIENTCHANCE_III/> chance to disorient for <Ability:HEAL_DISORIENTLENGTH_III/> turns, <Ability:HEAL_STUNCHANCE_III/> chance to stun for <Ability:HEAL_STUNLENGTH_III/> turns and a <Ability:HEAL_UNCONSCIOUSHANCE_III/> chance to render the target unconscious."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Sedative Bite has a <Ability:HEAL_DISORIENTCHANCE_III/> chance to disorient for <Ability:HEAL_DISORIENTLENGTH_III/> turns, <Ability:HEAL_STUNCHANCE_III/> chance to stun for <Ability:HEAL_STUNLENGTH_III/> turns and a <Ability:HEAL_UNCONSCIOUSHANCE_III/> chance to render the target unconscious."


[MAW_AcidBite_I X2AbilityTemplate]
LocFriendlyName = "Acidic Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and inflicting acid burn to them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Acidic Bite will also inflict acid burn to the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Acidic Bite will also inflict acid burn to the target upon hit."

[MAW_AcidBite_II X2AbilityTemplate]
LocFriendlyName = "Acidic Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and inflicting acid burn to them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Acidic Bite will also inflict acid burn to the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Acidic Bite will also inflict acid burn to the target upon hit."

[MAW_AcidBite_III X2AbilityTemplate]
LocFriendlyName = "Acidic Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and inflicting acid burn to them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Acidic Bite will also inflict acid burn to the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Acidic Bite will also inflict acid burn to the target upon hit."


[MAW_FireBite_I X2AbilityTemplate]
LocFriendlyName = "Scalding Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and setting fire to them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Scalding Bite will also set fire to the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Scalding Bite will also set fire to the target upon hit."

[MAW_FireBite_II X2AbilityTemplate]
LocFriendlyName = "Scalding Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and setting fire to them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Scalding Bite will also set fire to the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Scalding Bite will also set fire to the target upon hit."

[MAW_FireBite_III X2AbilityTemplate]
LocFriendlyName = "Scalding Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and setting fire to them."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Scalding Bite will also set fire to the target upon hit."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Scalding Bite will also set fire to the target upon hit."


[MAW_ElectricBite_I X2AbilityTemplate]
LocFriendlyName = "Jolting Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and potentally shutting down robotic targets."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Jolting Bite has a <Ability:ELECTRIC_STUNCHANCE_I/> chance to shutdown robotic units for <Ability:ELECTRIC_STUNLENGTH_I/> turns, in addition to removing energy shields from the target."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Jolting Bite has a <Ability:ELECTRIC_STUNCHANCE_I/> chance to shutdown robotic units for <Ability:ELECTRIC_STUNLENGTH_I/> turns, in addition to removing energy shields from the target."

[MAW_ElectricBite_II X2AbilityTemplate]
LocFriendlyName = "Jolting Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and potentally shutting down robotic targets."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Jolting Bite has a <Ability:ELECTRIC_STUNCHANCE_II/> chance to shutdown robotic units for <Ability:ELECTRIC_STUNLENGTH_II/> turns, in addition to removing energy shields from the target."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Jolting Bite has a <Ability:ELECTRIC_STUNCHANCE_II/> chance to shutdown robotic units for <Ability:ELECTRIC_STUNLENGTH_II/> turns, in addition to removing energy shields from the target."

[MAW_ElectricBite_III X2AbilityTemplate]
LocFriendlyName = "Jolting Bite"
LocHelpText = "The Viper peforms a bite attack against an adjacent target, inflicting damage upon the target and potentally shutting down robotic targets."
LocLongDescription = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Jolting Bite has a <Ability:ELECTRIC_STUNCHANCE_III/> chance to shutdown robotic units for <Ability:ELECTRIC_STUNLENGTH_III/> turns, in addition to removing energy shields from the target."
LocPromotionPopupText = "Perform a melee attack against an adjacent target. Peforming a Bite attack cost <Ability:BITE_COST/> AP to use and <Ability:BITE_ENDSTURN/> Jolting Bite has a <Ability:ELECTRIC_STUNCHANCE_III/> chance to shutdown robotic units for <Ability:ELECTRIC_STUNLENGTH_III/> turns, in addition to removing energy shields from the target."

; - Spits -

[MAW_PoisonSpit_I X2AbilityTemplate]
LocFriendlyName = "Venom Spit"
LocHelpText = "The Viper spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."
LocLongDescription = "The Viper spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."
LocPromotionPopupText = "The Viper spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."

[MAW_PoisonSpit_II X2AbilityTemplate]
LocFriendlyName = "Enhanced Venom Spit"
LocHelpText = "The Viper spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."
LocLongDescription = "The Viper spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."
LocPromotionPopupText = "The Viper spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."

[MAW_PoisonSpit_III X2AbilityTemplate]
LocFriendlyName = "Neuro-Venom Spit"
LocHelpText = "The Viper spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."
LocLongDescription = "The Viper spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."
LocPromotionPopupText = "The Viper spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."


[MAW_IceSpit_I X2AbilityTemplate]
LocFriendlyName = "Frost Spit"
LocHelpText = "The Viper spits out a near sub-zero liquid that freezes all those caught in it's impact."
LocLongDescription = "The Viper spits out a near sub-zero liquid that freezes all those caught in it's impact."
LocPromotionPopupText = "The Viper spits out a near sub-zero liquid that freezes all those caught in it's impact."

[MAW_IceSpit_II X2AbilityTemplate]
LocFriendlyName = "Enhanced Frost Spit"
LocHelpText = "The Viper spits out a near sub-zero liquid that freezes all those caught in it's impact."
LocLongDescription = "The Viper spits out a near sub-zero liquid that freezes all those caught in it's impact."
LocPromotionPopupText = "The Viper spits out a near sub-zero liquid that freezes all those caught in it's impact."

[MAW_IceSpit_III X2AbilityTemplate]
LocFriendlyName = "Blizzard Spit"
LocHelpText = "The Viper spits out a near sub-zero liquid that freezes all those caught in it's impact."
LocLongDescription = "The Viper spits out a near sub-zero liquid that freezes all those caught in it's impact."
LocPromotionPopupText = "The Viper spits out a near sub-zero liquid that freezes all those caught in it's impact."


[MAW_HealSpit_I X2AbilityTemplate]
LocFriendlyName = "Anti-Venom Spit"
LocHelpText = "The Viper spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."
LocLongDescription = "The Viper spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."
LocPromotionPopupText = "The Viper spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."

[MAW_HealSpit_II X2AbilityTemplate]
LocFriendlyName = "Enhanced Anti-Venom Spit"
LocHelpText = "The Viper spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."
LocLongDescription = "The Viper spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."
LocPromotionPopupText = "The Viper spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."

[MAW_HealSpit_III X2AbilityTemplate]
LocFriendlyName = "Restorative Spit"
LocHelpText = "The Viper spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."
LocLongDescription = "The Viper spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."
LocPromotionPopupText = "The Viper spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."


[MAW_FireSpit_I X2AbilityTemplate]
LocFriendlyName = "Inferno Spit"
LocHelpText = "The Viper spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."
LocLongDescription = "The Viper spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."
LocPromotionPopupText = "The Viper spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."

[MAW_FireSpit_II X2AbilityTemplate]
LocFriendlyName = "Enhanced Inferno Spit"
LocHelpText = "The Viper spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."
LocLongDescription = "The Viper spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."
LocPromotionPopupText = "The Viper spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."

[MAW_FireSpit_III X2AbilityTemplate]
LocFriendlyName = "Immolation Spit"
LocHelpText = "The Viper spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."
LocLongDescription = "The Viper spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."
LocPromotionPopupText = "The Viper spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."


[MAW_AcidSpit_I X2AbilityTemplate]
LocFriendlyName = "Acid Spit"
LocHelpText = "The Viper spits an acidic reagent which explodes into a strong corrosive acid that shreads armour and burns those affected over time."
LocLongDescription = "The Viper spits an acidic reagent which explodes into a strong corrosive acid that shreads armour and burns those affected over time."
LocPromotionPopupText = "The Viper spits an acidic reagent which explodes into a strong corrosive acid that shreads armour and burns those affected over time."

[MAW_AcidSpit_II X2AbilityTemplate]
LocFriendlyName = "Enhanced Acid Spit"
LocHelpText = "The Viper spits an acidic reagent which explodes into a strong corrosive acid that shreads armour and burns those affected over time."
LocLongDescription = "The Viper spits an acidic reagent which explodes into a strong corrosive acid that shreads armour and burns those affected over time."
LocPromotionPopupText = "The Viper spits an acidic reagent which explodes into a strong corrosive acid that shreads armour and burns those affected over time."

[MAW_AcidSpit_III X2AbilityTemplate]
LocFriendlyName = "Corrosion Spit"
LocHelpText = "The Viper spits an acidic reagent which explodes into a strong corrosive acid that shreads armour and burns those affected over time."
LocLongDescription = "The Viper spits an acidic reagent which explodes into a strong corrosive acid that shreads armour and burns those affected over time."
LocPromotionPopupText = "The Viper spits an acidic reagent which explodes into a strong corrosive acid that shreads armour and burns those affected over time."


[MAW_ElectricSpit_I X2AbilityTemplate]
LocFriendlyName = "Electric Spit"
LocHelpText = "The Viper spits an highly conductive chemical that reacts upon impact, dealing damage to robotic units with a cahnce to shut them down."
LocLongDescription = "The Viper spits an highly conductive chemical that reacts upon impact, dealing damage to robotic units with a cahnce to shut them down."
LocPromotionPopupText = "The Viper spits an highly conductive chemical that reacts upon impact, dealing damage to robotic units with a cahnce to shut them down."

[MAW_ElectricSpit_II X2AbilityTemplate]
LocFriendlyName = "Enhanced Electric Spit"
LocHelpText = "The Viper spits an highly conductive chemical that reacts upon impact, dealing damage to robotic units with a cahnce to shut them down."
LocLongDescription = "The Viper spits an highly conductive chemical that reacts upon impact, dealing damage to robotic units with a cahnce to shut them down."
LocPromotionPopupText = "The Viper spits an highly conductive chemical that reacts upon impact, dealing damage to robotic units with a cahnce to shut them down."

[MAW_ElectricSpit_III X2AbilityTemplate]
LocFriendlyName = "Bluescreen Spit"
LocHelpText = "The Viper spits an highly conductive chemical that reacts upon impact, dealing damage to robotic units with a cahnce to shut them down."
LocLongDescription = "The Viper spits an highly conductive chemical that reacts upon impact, dealing damage to robotic units with a cahnce to shut them down."
LocPromotionPopupText = "The Viper spits an highly conductive chemical that reacts upon impact, dealing damage to robotic units with a cahnce to shut them down."

[Viper_MAW_I_Bonus X2AbilityTemplate]
LocFriendlyName = "M.A.W Strenght bonus"
LocHelpText = "You shouldn't be seeing this..."
LocLongDescription = "You shouldn't be seeing this..."
LocPromotionPopupText = "You shouldn't be seeing this..."

[Viper_MAW_II_Bonus X2AbilityTemplate]
LocFriendlyName = "M.A.W Strenght bonus"
LocHelpText = "You shouldn't be seeing this..."
LocLongDescription = "You shouldn't be seeing this..."
LocPromotionPopupText = "You shouldn't be seeing this..."

[Viper_MAW_III_Bonus X2AbilityTemplate]
LocFriendlyName = "M.A.W Strenght bonus"
LocHelpText = "You shouldn't be seeing this..."
LocLongDescription = "You shouldn't be seeing this..."
LocPromotionPopupText = "You shouldn't be seeing this..."

; - M.A.Ws -

[EmptyPrimaryViper X2WeaponTemplate]
FriendlyName="Empty"
FriendlyNamePlural="Empty"
BriefSummary="Empty"
TacticalText="Empty"
AbilityDescName="Empty"

[BoaWeapon X2WeaponTemplate]
FriendlyName="Unarmed"
FriendlyNamePlural="Unarmed"
BriefSummary="Unarmed"
TacticalText="Unarmed"
AbilityDescName="Unarmed"

[MAW_Neutral X2WeaponTemplate]
FriendlyName="Neutral M.A.W Implant"
FriendlyNamePlural="Neutral M.A.W Implants"
BriefSummary="A Mouth Augmentation Weapon, or M.A.W Implant for short, allows a Viper to use ther renown biological weapons to their fullest intent."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Neutral M.A.W Implant lacks any sort of additional effect other models do, and doesn't have any additional effects."
AbilityDescName="Neutral M.A.W Implant"


[MAW_Poison_I X2WeaponTemplate]
FriendlyName="Venom M.A.W"
FriendlyNamePlural="Venom M.A.Ws"
BriefSummary="A M.A.W Implant imbued with a deadly Venom, allowing the Viper to inflict poison with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Venom M.A.W 'Toxic' converts the Viper's rather weak Venom, into a much more deadly Venom that can be lethal to most biological creatures.\n<Bullet/> Poison effects from this M.A.W deal <font color='#3ABD23'>1-3</font> damage per turn, last for <font color='#3ABD23'>3</font> turns, and inflict a <font color='#3ABD23'>-4</font> mobility and <font color='#3ABD23'>-30</font> aim debuff on the affected targets.\n<Bullet/> Tier 1 M.A.Ws also provide a bonus <font color='#3ABD23'>+10</font> strength while binding."
AbilityDescName="Venom M.A.W"

[MAW_Poison_II X2WeaponTemplate]
FriendlyName="Enhanced Venom M.A.W"
FriendlyNamePlural="Enhanced Venom M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with a deadly Venom, allowing the Viper to inflict poison with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Enhanced Venom M.A.W converts the Viper's rather weak Venom, into a much more deadly Venom that can be lethal to most biological creatures.\n<Bullet/> Poison effects from this M.A.W deal <font color='#b7bd1c'>2-4</font> damage per turn, last for <font color='#b7bd1c'>4</font> turns, and inflict a <font color='#b7bd1c'>-5</font> mobility and <font color='#b7bd1c'>-35</font> aim debuff on the affected targets.\n<Bullet/> Tier 2 M.A.Ws also provide a bonus <font color='#b7bd1c'>+20</font> strength while binding."
AbilityDescName="Enhanced Venom M.A.W"

[MAW_Poison_III X2WeaponTemplate]
FriendlyName="Neuro-Venom M.A.W"
FriendlyNamePlural="Neuro-Venom M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with a deadly Venom, allowing the Viper to inflict poison with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Neuro-Venom M.A.W converts the Viper's rather weak Venom, into a much more deadly Venom that can be lethal to most biological creatures.\n<Bullet/> Poison effects from this M.A.W deal <font color='#d48013'>3-4</font> damage per turn, last for <font color='#d48013'>4</font> turns, and inflict a <font color='#d48013'>-6</font> mobility and <font color='#d48013'>-40</font> aim debuff on the affected targets.\n<Bullet/> Tier 3 M.A.Ws also provide a bonus <font color='#d48013'>+30</font> strength while binding."
AbilityDescName="Neuro-Venom M.A.W"


[MAW_Acid_I X2WeaponTemplate]
FriendlyName="Acid M.A.W"
FriendlyNamePlural="Acid M.A.Ws"
BriefSummary="A M.A.W Implant imbued with a corrosive acid, allowing the Viper to inflict acid burns with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Acid M.A.W converts the Viper's rather weak Venom, into a extremely corrosive agent that can dissolve some of the strongest armour, and inflict deadly acid burns upon a target.\n<Bullet/> The acid burn effects from this M.A.W deal <font color='#3ABD23'>1-3</font> damage per turn, last for <font color='#3ABD23'>3</font> turns in addition to the spit dealing <font color='#3ABD23'>1-3</font> damage on impact and shredding <font color='#3ABD23'>2</font> armour from the target.\n<Bullet/> Tier 1 M.A.Ws also provide a bonus <font color='#3ABD23'>+10</font> strength while binding."
AbilityDescName="Acid M.A.W"

[MAW_Acid_II X2WeaponTemplate]
FriendlyName="Enhanced Acid M.A.W"
FriendlyNamePlural="Enhanced Acid M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with a corrosive acid, allowing the Viper to inflict acid burns with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Enhanced Acid M.A.W converts the Viper's rather weak Venom, into a extremely corrosive agent that can dissolve some of the strongest armour, and inflict deadly acid burns upon a target.\n<Bullet/> The acid burn effects from this M.A.W deal <font color='#b7bd1c'>2-4</font> damage per turn, last for <font color='#b7bd1c'>4</font> turns in addition to the spit dealing <font color='#b7bd1c'>1-5</font> damage on impact and shredding <font color='#b7bd1c'>3</font> armour from the target.\n<Bullet/> Tier 2 M.A.Ws also provide a bonus <font color='#b7bd1c'>+20</font> strength while binding."
AbilityDescName="Enhanced Acid M.A.W"

[MAW_Acid_III X2WeaponTemplate]
FriendlyName="Corrosive M.A.W"
FriendlyNamePlural="Corrosive M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with a corrosive acid, allowing the Viper to inflict acid burns with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Corrosive M.A.W converts the Viper's rather weak Venom, into a extremely corrosive agent that can dissolve some of the strongest armour, and inflict deadly acid burns upon a target.\n<Bullet/> The acid burn effects from this M.A.W deal <font color='#d48013'>3-6</font> damage per turn, last for <font color='#d48013'>4</font> turns in addition to the spit dealing <font color='#d48013'>2-6</font> damage on impact and shredding <font color='#d48013'>4</font> armour from the target.\n<Bullet/> Tier 3 M.A.Ws also provide a bonus <font color='#d48013'>+30</font> strength while binding."
AbilityDescName="Corrosive M.A.W"


[MAW_Heal_I X2WeaponTemplate]
FriendlyName="Anti-Venom M.A.W"
FriendlyNamePlural="Anti-Venom M.A.Ws"
BriefSummary="A M.A.W Implant imbued with a smart healing agent, allowing the Viper to heal allies with their spit, in addition to being able to potentally K.O enemies with it's spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Anti-Venom M.A.W converts the Viper's rather weak Venom, into a smart healing agent that can restore the health of allies, in addition to inflicting non-lethal status effects upon enemy targets.\n<Bullet/> The effects from this M.A.W heal friendly targets for <font color='#3ABD23'>2</font> HP, and while it may not heal enemies, instead has a <font color='#3ABD23'>50%</font> chance to disorientate for <font color='#3ABD23'>2</font> turns, a <font color='#3ABD23'>25%</font> chance to stun for <font color='#3ABD23'>2</font> turns and a <font color='#3ABD23'>15%</font> chance to K.O the target.\n<Bullet/> Tier 1 M.A.Ws also provide a bonus <font color='#3ABD23'>+10</font> strength while binding."
AbilityDescName="Anti-Venom M.A.W"

[MAW_Heal_II X2WeaponTemplate]
FriendlyName="Enhanced Anti-Venom M.A.W"
FriendlyNamePlural="Enhanced Anti-Venom M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with a smart healing agent, allowing the Viper to heal allies with their spit, in addition to being able to potentally K.O enemies with it's spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Enhanced Anti-Venom M.A.W converts the Viper's rather weak Venom, into a smart healing agent that can restore the health of allies, in addition to inflicting non-lethal status effects upon enemy targets.\n<Bullet/> The effects from this M.A.W heal friendly targets for <font color='#b7bd1c'>4</font> HP, and while it may not heal enemies, instead has a <font color='#b7bd1c'>75%</font> chance to disorientate for <font color='#b7bd1c'>3</font> turns, a <font color='#b7bd1c'>50%</font> chance to stun for <font color='#b7bd1c'>3</font> turns and a <font color='#b7bd1c'>30%</font> chance to K.O the target.\n<Bullet/> Tier 2 M.A.Ws also provide a bonus <font color='#b7bd1c'>+20</font> strength while binding."
AbilityDescName="Enhanced Anti-Venom M.A.W"

[MAW_Heal_III X2WeaponTemplate]
FriendlyName="Restorative M.A.W"
FriendlyNamePlural="Restorative M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with a smart healing agent, allowing the Viper to heal allies with their spit, in addition to being able to potentally K.O enemies with it's spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Restorative M.A.W converts the Viper's rather weak Venom, into a smart healing agent that can restore the health of allies, in addition to inflicting non-lethal status effects upon enemy targets.\n<Bullet/> The effects from this M.A.W heal friendly targets for <font color='#d48013'>6</font> HP, and while it may not heal enemies, instead has a <font color='#d48013'>100%</font> chance to disorientate for <font color='#d48013'>4</font> turns, a <font color='#d48013'>75%</font> chance to stun for <font color='#d48013'>4</font> turns and a <font color='#d48013'>50%</font> chance to K.O the target.\n<Bullet/> Tier 3 M.A.Ws also provide a bonus <font color='#d48013'>+30</font> strength while binding."
AbilityDescName="Restorative M.A.W"


[MAW_Electric_I X2WeaponTemplate]
FriendlyName="Electric M.A.W"
FriendlyNamePlural="Electric M.A.Ws"
BriefSummary="A M.A.W Implant imbued with an highly conductive vapor, allowing the Viper to deal signifigant damage to targets weak to tech with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Electric M.A.W converts the Viper's rather weak Venom, into an highly conductive vapor that is very effective against robotic units.\n<Bullet/>. The spit effects from this M.A.W inflict <font color='#3ABD23'>2-4</font> damage on impact against robotic units, in addition to the bite and spit lowering robotuc unit's hack defence, a <font color='#3ABD23'>33%</font> chance to stun robotic units for <font color='#3ABD23'>2</font> turns in addition to removing energy shields from the affected targets.\n<Bullet/> Tier 1 M.A.Ws also provide a bonus <font color='#3ABD23'>+10</font> strength while binding."
AbilityDescName="Electric M.A.W"

[MAW_Electric_II X2WeaponTemplate]
FriendlyName="Enhanced Electric M.A.W"
FriendlyNamePlural="Enhanced Electric M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with an highly conductive vapor, allowing the Viper to deal signifigant damage to targets weak to tech with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Enhanced Electric M.A.W converts the Viper's rather weak Venom, into an highly conductive vapor that is very effective against robotic units.\n<Bullet/>. The spit effects from this M.A.W inflict <font color='#b7bd1c'>4-6</font> damage on impact against robotic units, in addition to the bite and spit lowering robotuc unit's hack defence, a <font color='#b7bd1c'>66%</font> chance to stun robotic units for <font color='#b7bd1c'>3</font> turns in addition to removing energy shields from the affected targets.\n<Bullet/> Tier 2 M.A.Ws also provide a bonus <font color='#b7bd1c'>+20</font> strength while binding."
AbilityDescName="Enhanced Electric M.A.W"

[MAW_Electric_III X2WeaponTemplate]
FriendlyName="Bluescreen M.A.W"
FriendlyNamePlural="Bluescreen M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with an highly conductive vapor, allowing the Viper to deal signifigant damage to targets weak to tech with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Bluescreen M.A.W converts the Viper's rather weak Venom, into an highly conductive vapor that is very effective against robotic units.\n<Bullet/>. The spit effects from this M.A.W inflict <font color='#d48013'>6-8</font> damage on impact against robotic units, in addition to the bite and spit lowering robotuc unit's hack defence, a <font color='#d48013'>100%</font> chance to stun robotic units for <font color='#d48013'>4</font> turns in addition to removing energy shields from the affected targets.\n<Bullet/> Tier 3 M.A.Ws also provide a bonus <font color='#d48013'>+30</font> strength while binding."
AbilityDescName="Bluescreen M.A.W"


[MAW_Fire_I X2WeaponTemplate]
FriendlyName="Inferno M.A.W"
FriendlyNamePlural="Inferno M.A.Ws"
BriefSummary="A M.A.W Implant imbued with a highly volatile liquid, allowing the Viper to set fire to targets with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Inferno M.A.W converts the Viper's rather weak Venom, into a highly volatile liquid that can ignite both the enviroment and set fire to affected targets.\n<Bullet/> The burn effects from this M.A.W deal <font color='#3ABD23'>2</font> damage per turn, last for <font color='#3ABD23'>3</font> turns.\n<Bullet/> Tier 1 M.A.Ws also provide a bonus <font color='#3ABD23'>+10</font> strength while binding."
AbilityDescName="Inferno M.A.W"

[MAW_Fire_II X2WeaponTemplate]
FriendlyName="Enhanced Inferno M.A.W"
FriendlyNamePlural="Enhanced Inferno M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with a highly volatile liquid, allowing the Viper to set fire to targets with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Enhanced Inferno M.A.W converts the Viper's rather weak Venom, into a highly volatile liquid that can ignite both the enviroment and set fire to affected targets.\n<Bullet/> The burn effects from this M.A.W deal <font color='#b7bd1c'>2-4</font> damage per turn, last for <font color='#b7bd1c'>4</font> turns.\n<Bullet/> Tier 2 M.A.Ws also provide a bonus <font color='#b7bd1c'>+20</font> strength while binding."
AbilityDescName="Enhanced Inferno M.A.W"

[MAW_Fire_III X2WeaponTemplate]
FriendlyName="Immolation M.A.W"
FriendlyNamePlural="Immolation M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with a highly volatile liquid, allowing the Viper to set fire to targets with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Immolation M.A.W converts the Viper's rather weak Venom, into a highly volatile liquid that can ignite both the enviroment and set fire to affected targets.\n<Bullet/> The burn effects from this M.A.W deal <font color='#d48013'>4</font> damage per turn, last for <font color='#d48013'>4</font> turns.\n<Bullet/> Tier 3 M.A.Ws also provide a bonus <font color='#d48013'>+30</font> strength while binding."
AbilityDescName="Immolation M.A.W"


[MAW_Ice_I X2WeaponTemplate]
FriendlyName="Frost M.A.W"
FriendlyNamePlural="Frost M.A.Ws"
BriefSummary="A M.A.W Implant imbued with a near sub-zero liquid, allowing the Viper to freeze targets with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Frost M.A.W converts the Viper's rather weak Venom, into a near sub-zero liquid that can freeze targets.\n<Bullet/> The freeze effects from this M.A.W last for <font color='#3ABD23'>1</font> turn and affect rulers for <font color='#3ABD23'>2</font> actions.\n<Bullet/> Tier 1 M.A.Ws also provide a bonus <font color='#3ABD23'>+10</font> strength while binding."
AbilityDescName="Frost M.A.W"

[MAW_Ice_II X2WeaponTemplate]
FriendlyName="Enhanced Frost M.A.W"
FriendlyNamePlural="Enhanced Frost M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with a near sub-zero liquid, allowing the Viper to freeze targets with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Enhanced Frost M.A.W converts the Viper's rather weak Venom, into a near sub-zero liquid that can freeze targets.\n<Bullet/> The freeze effects from this M.A.W last for <font color='#b7bd1c'>1</font> turn and affect rulers for <font color='#b7bd1c'>4</font> actions.\n<Bullet/> Tier 2 M.A.Ws also provide a bonus <font color='#b7bd1c'>+20</font> strength while binding."
AbilityDescName="Frost M.A.W"

[MAW_Ice_III X2WeaponTemplate]
FriendlyName="Blizzard M.A.W"
FriendlyNamePlural="Blizzard M.A.Ws"
BriefSummary="An Enhanced M.A.W Implant imbued with a near sub-zero liquid, allowing the Viper to freeze targets with their spit and bite."
TacticalText="<Bullet/> M.A.W Implants allows a Viper to utilize their biological weapons to their fullest intent.\n<Bullet/> The Blizzard M.A.W converts the Viper's rather weak Venom, into a near sub-zero liquid that can freeze targets.\n<Bullet/> The freeze effects from this M.A.W last for <font color='#d48013'>2</font> turns and affect rulers for <font color='#d48013'>6</font> actions.\n<Bullet/> Tier 3 M.A.Ws also provide a bonus <font color='#d48013'>+30</font> strength while binding."
AbilityDescName="Blizzard M.A.W"

; - Techs -

[MAWTech_I X2TechTemplate]
DisplayName="Experimental M.A.W Implants"
Summary="With some time and effort, I believe I can come up with some designs that improve upon the M.A.W Implant our Viper Soldiers utilize, Improving their effectivness with such device and allowing them to 'alter' their Venom to something more powerful."
CodeName="Incisor"
LongDescription="Upon closer inspection of the \"Mouth Augmentation Weapon,\" or \"M.A.W Implant\" for short, it appears that the device, which is installed around the base of the subject's neck, converts a Viper's Venom into an alternative substance much more deadlier than the original product. This is seen present in the Vipers we encounter with ADVENT, as they use a M.A.W Implant to turn their Venom into something far deadlier that they \"Spit\" at our soldiers. While it appears that our own Viper Comrades do not have access to such device, I believe I can improve upon the already existing M.A.W Implant device they utilize instead, and allow them to transform their Venom into something far deadlier and/or versatile that suits the Viper's needs. R. Tygan."

[MAWTech_II X2TechTemplate]
DisplayName="Advanced M.A.W Implants"
Summary="With a bit more insight, we can expect that we will be able to improve upon the M.A.W Implants that we've come up with so far."
CodeName="Incisors"
LongDescription="Upon Shen's request, I've looked into the current designs of our \"M.A.W Implants\" and observed some serious flaws with their current designs that hinder their effectivness and overall potentail. I suspect with a few more improvments to the Weapon's sub-systems, we can expect signifigant improvments from the old Implant's design. R. Tygan."

[MAWTech_III X2TechTemplate]
DisplayName="Superior M.A.W Implants"
Summary="With the introduction of elerium, I suspect that we will be able to vastly improve upon the M.A.W Implants that we've designed."
CodeName="Fang"
LongDescription="As I suspected, the main hurdle in increasing the effectivness of our \"M.A.W Implants\" was the lack of a portable and renewable power source that could both fit into the Implant and not cause any harm or hindrance to the user. While this seemed like an impossible task, with the introduction of elerium into the Implant, I believe the substance could fulfill these requirements, allowing us to access the most effective forms of our M.A.W Implants while keeping the overall design and profile you would expect from an Implant. R. Tygan."